app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    if params[:artist_id]
        artist = Artist.find_by(id: params[:artist_id])
        if artist.nil?
          redirect_to artists_path, alert: "Artist not found"
        else
          @song = artist.songs.find_by(id: params[:id])